Documents/ПродлениеСроковНоскиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПродлениеСроковНоскиСИЗ</Name>
			<BasedOn>
				<xr:Item>Document.ВыдачаСИЗ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыдачиСИЗПоНоменклатуре</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>// АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СИЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВыдачи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продлить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующейВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВыдачи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследняяВыдача</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дежурное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПериодичностиВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВыдачиСИЗПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыдачиСИЗПоНоменклатуре</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокНоскиПродлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноВыдано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДействияСИстекающимиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияСИстекающимиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродлитьСрокНоски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПродлениеСроковНоскиСИЗ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Основание");	
		Если ЗначениеЗаполнено(Основание) Тогда
			Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "УчитыватьТолькоИстекающие", Ложь) Тогда
				ЗаполнитьПоВыдачеСИЗ(Основание);
			ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "УчитыватьТолькоОтмеченные", Ложь) Тогда
				ЗаполнитьПоВыдачеСИЗ(Основание, Ложь);
			Иначе
				ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка, Основание);
			КонецЕсли;
		Иначе
			ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, Дата, "Объект.Дата", Отказ, НСтр("ru='Дата продления'"), , , Ложь);
	
	ОхранаТруда.ОбработкаПроверкиЗаполненияКомиссии(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	Для Индекс = 0 По РабочиеМеста.Количество()-1 Цикл
		СтрокаРабочееМесто = РабочиеМеста.Получить(Индекс);
		СтрокиНоменклатурыРабочегоМеста = НоменклатураСИЗ.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста));
		
		Для Каждого СтрокаНоменклатураСИЗ Из СтрокиНоменклатурыРабочегоМеста Цикл
			Если Не ЗначениеЗаполнено(СтрокаНоменклатураСИЗ.Номенклатура) И СтрокаНоменклатураСИЗ.Продлить Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Сотруднику ""%1"" не установлена номенклатура для продления по СИЗ ""%2""'"),
					СтрокаРабочееМесто.ФизическоеЛицо, СтрокаНоменклатураСИЗ.СИЗ);
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"РабочиеМеста", СтрокаРабочееМесто.НомерСтроки, "ФизическоеЛицо");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	ИдентификаторыСтрокРабочихМест = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из РабочиеМеста Цикл
		ИдентификаторыСтрокРабочихМест.Вставить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста, СтрокаТаблицы);
	КонецЦикла;
	ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест)
	
	Для Каждого СтрокаТаблицы Из НоменклатураСИЗ Цикл
		Если Не СтрокаТаблицы.Продлить Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьНабора = Движения.ВыдачиСИЗПоНоменклатуре.Добавить();
		ЗаписьНабора.Период = Дата;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.РезультатВыдачи = Перечисления.РезультатыВыдачиСИЗ.СрокНоскиПродлен;
		ЗаписьНабора.ОснованиеВыдачи = СтрокаТаблицы.ОснованиеВыдачи;
		ЗаписьНабора.ДокументВыдачи = СтрокаТаблицы.ДокументВыдачи;
		ЗаписьНабора.ДатаСледующейВыдачи = СтрокаТаблицы.ДатаСледующейВыдачи;
		Движения.ВыдачиСИЗПоНоменклатуре.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка, Основание = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация, Подразделение, Дата");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования, , "Дата");
		ЗаполнитьЗначенияПоУмолчанию();
		ЗаполнитьСИЗКПродлению(Документы.ВыдачаСИЗ.ФизическиеЛицаРабочиеМестаВыдачи(Основание), "РабочееМесто", , , РеквизитыОснования.Дата);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ЗаполнитьЗначенияПоУмолчанию();
		Если ДанныеЗаполнения.Свойство("ФизическиеЛицаРабочиеМеста") Тогда
			ЗаполнитьСИЗКПродлению(ДанныеЗаполнения.ФизическиеЛицаРабочиеМеста, "РабочееМесто");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
	Ответственный = ЗначенияПоУмолчанию.Ответственный;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗ(ИдентификаторыСИЗ) Экспорт
	
	НоменклатураСИЗ.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивСИЗ = ИдентификаторыСИЗ.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивСИЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДанныеСИЗ Из МассивСИЗ Цикл
			Если ДанныеСИЗ.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = НоменклатураСИЗ.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСИЗ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗКПродлению(ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, Сч = 1, ДобавлятьБезСИЗ = Ложь, ДатаАктуальности = Неопределено) Экспорт
	
	ОтмеченныеСИЗ = Неопределено;
	ТаблицаФизическиеЛицаРабочиеМеста = СредстваИндивидуальнойЗащиты.ТаблицаФизическиеЛицаРабочиеМеста(
		ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, ОтмеченныеСИЗ);
	
	Если ТаблицаФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = Дата;
	КонецЕсли;
	
	ВыданныеСИЗ = СредстваИндивидуальнойЗащиты.ВыданныеСИЗ(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности, ОтмеченныеСИЗ);
	Для Каждого ДанныеСИЗ Из ТаблицаФизическиеЛицаРабочиеМеста Цикл
		СИЗРабочихМест = ВыданныеСИЗ.НайтиСтроки(
			Новый Структура("РабочееМесто, ФизическоеЛицо", ДанныеСИЗ.РабочееМесто, ДанныеСИЗ.ФизическоеЛицо));
		ЕстьСИЗ = Ложь;
		ПоследниеВыдачиСИЗ = СредстваИндивидуальнойЗащиты.ПоследниеВыдачиСИЗПоНоменклатуре(
			ДанныеСИЗ.ФизическоеЛицо, Организация, ДатаАктуальности);
		Для Каждого НайденныйСИЗ Из СИЗРабочихМест Цикл
			Если НайденныйСИЗ.Количество <= 0 Или НайденныйСИЗ.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденныйСИЗ);
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = Сч;
			Если ПоследниеВыдачиСИЗ <> Неопределено Тогда
				ПоследняяВыдачаСИЗ = ПоследниеВыдачиСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ);
				Если ПоследняяВыдачаСИЗ <> Неопределено Тогда
					НоваяСтрокаСИЗ.ПоследняяВыдача = ПоследняяВыдачаСИЗ.Период;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрокаСИЗ.ДатаСледующейВыдачи = Дата;
			ЕстьСИЗ = Истина;
		КонецЦикла;
		Если Не ЕстьСИЗ Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = РабочиеМеста.Добавить();
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = Сч;
		НоваяСтрока.ФизическоеЛицо = ДанныеСИЗ.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = ДанныеСИЗ.РабочееМесто;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.РабочееМесто, "Подразделение,Должность"));
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоВыдачеСИЗ(ДокументСсылка, ТолькоИстекающие = Истина)
	
	РеквизитыШапки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация, Подразделение");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
	
	СредстваИндивидуальнойЗащиты.ЗаполнитьДокументПоВыдачеСИЗ(
		ЭтотОбъект, ДокументСсылка, Перечисления.ДействияСИстекающимиСИЗ.ПродлитьСрокНоски, ТолькоИстекающие);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
